УТ_для_edt/src/AccumulationRegisters/смартЗаявкиНаРазборкуОборудования/смартЗаявкиНаРазборкуОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартЗаявкиНаРазборкуОборудования</name>
  <comment>#1901 смарт: Ермаков 20.08.2024 / Создание документа Заявка на разборку оборудования</comment>
  <resources>
    <name>КРазборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПолучению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаРазборкуОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОтгрузкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОформлениюГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКСборкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобираетсяГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобраноГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/ДоступныеОстаткиПланируемыхПоступлений/ДоступныеОстаткиПланируемыхПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоступныеОстаткиПланируемыхПоступлений</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДоступности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеСоСклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВНаличииГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеСоСкладаГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРасходныхОрдеров</name>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>КОтбору</name>
  </enumValues>
  <enumValues>
    <name>КПроверке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеПроверки</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/CommonModules/смартПроведениеСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнитьЗапрос(МенеджерВременныхТаблиц, Текст) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = Текст;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//++ #1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования
Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ПараметрыОбработчикаОбновления.РежимВыполнения) Тогда 
		Возврат;
	КонецЕсли;

	ДанныеТаблиц = Объект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	МассивКонтролей = Новый Массив;
	СписокЗапросов  = Новый Массив;
	ПакетЗапросов   = Новый Запрос;
	
	// Контроль отрицательных остатков смартЗаявкиНаРазборкуОборудования.
	Если ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц, "смартЗаявкиНаРазборкуОборудования") Тогда
		
		МассивКонтролей.Добавить(ВРег("смартЗаявкиНаРазборкуОборудования"));
		
		СписокЗапросов.Добавить(
		"ВЫБРАТЬ
		|	Заявка, Номенклатура, Серия,
		|	КРазборкеОстаток КАК КРазборке,
		|	КПолучениюОстаток КАК КПолучению
		|ИЗ
		|	РегистрНакопления.смартЗаявкиНаРазборкуОборудования.Остатки(
		|		,,,
		|		(Заявка, Номенклатура, Серия) 
		|		В 
		|			(ВЫБРАТЬ Заявка, Номенклатура, Серия
		|			 ИЗ ДвиженияСмартЗаявкиНаРазборкуОборудования) 
		|	) КАК ТаблицаОстатков
		|ГДЕ
		|	КРазборкеОстаток < 0 ИЛИ КПолучениюОстаток < 0");	
				
	КонецЕсли;
	
	//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
	Если ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияСвободныеОстаткиИзменение")
		Или ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияГрафикОтгрузкиТоваровИзменение") Тогда

		ТекстЗапроса = смарт_ТекстЗапросаКонтрольОбеспечения(
			ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияСвободныеОстаткиИзменение"),
			ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияГрафикОтгрузкиТоваровИзменение"));

		МассивКонтролей.Добавить(Врег("смартОбеспечениеВременнаяТаблица1Гарантийные"));
		МассивКонтролей.Добавить(Врег("смартОбеспечениеВременнаяТаблица2Гарантийные"));
		МассивКонтролей.Добавить(Врег("смартОбеспечениеГарантийные"));

		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыКОтгрузкеИзменениеСводно") Тогда

		МассивКонтролей.Добавить(Врег("смартДвиженияТоварыКОтгрузкеСводноГарантийные"));

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура      КАК Номенклатура,
		|	Остатки.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
		|	Остатки.Характеристика    КАК Характеристика,
		|	Остатки.Назначение    	  КАК Назначение,
		|	Остатки.Склад             КАК Склад,
		|	Остатки.Серия             КАК Серия,
		|	СУММА(Остатки.КоличествоГарантийные) КАК КоличествоГарантийные
		|
		|ИЗ 
		|(ВЫБРАТЬ
		|	Т.Номенклатура       КАК Номенклатура,
		|	Т.Характеристика     КАК Характеристика,
		|	Т.Назначение     	 КАК Назначение,
		|	Т.Склад              КАК Склад,
		|	Т.Серия              КАК Серия,
		|	-Т.смартВРезервеГарантийныеОстаток - Т.смартКОтгрузкеГарантийныеОстаток КАК КоличествоГарантийные
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|			,
		|			(Номенклатура, Характеристика, Назначение, Склад, Серия) В
		|				(ВЫБРАТЬ
		|					Т.Номенклатура,
		|					Т.Характеристика,
		|					Т.Назначение,
		|					Т.Склад,
		|					Т.Серия
		|				ИЗ
		|					ДвиженияТоварыКОтгрузкеИзменениеСводно КАК Т)) КАК Т
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.Номенклатура    КАК Номенклатура,
		|	Т.Характеристика  КАК Характеристика,
		|	Т.Назначение	  КАК Назначение,
		|	Т.Склад           КАК Склад,
		|	Т.Серия           КАК Серия,
		|	Т.ВНаличииОстаток КАК КоличествоГарантийные
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			(Номенклатура, Характеристика, Назначение, Склад, Серия) В
		|				(ВЫБРАТЬ
		|					Т.Номенклатура,
		|					Т.Характеристика,
		|					Т.Назначение,
		|					Т.Склад,
		|					Т.Серия
		|				ИЗ
		|					ДвиженияТоварыКОтгрузкеИзменениеСводно КАК Т)) КАК Т
		|) КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.Характеристика,
		|	Остатки.Назначение,
		|	Остатки.Склад,
		|	Остатки.Серия
		|
		|ИМЕЮЩИЕ
		|	СУММА(Остатки.КоличествоГарантийные) < 0";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	// Контроль отрицательных остатков ТоварыКОтгрузке.
	Если ПроведениеСерверУТ.ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияТоварыКОтгрузкеИзменение") Тогда
		
		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("смартТоварыКОтгрузкеГарантийные"));
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаОстатков.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
		|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаОстатков.Характеристика КАК Характеристика,
		|	ТаблицаОстатков.Назначение КАК Назначение,
		|	ТаблицаОстатков.Серия КАК Серия,
		|	ТаблицаОстатков.Получатель                    КАК Получатель,
		|	ТаблицаОстатков.Склад КАК Склад,
		|	ТаблицаОстатков.смартКОтгрузкеГарантийныеОстаток - ТаблицаОстатков.смартСобираетсяГарантийныеОстаток - ТаблицаОстатков.смартСобраноГарантийныеОстаток КАК КоличествоГарантийные
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки(,
		|			(ДокументОтгрузки, Номенклатура, Характеристика, Назначение, Серия, Получатель, Склад) В
		|				(ВЫБРАТЬ
		|					Таблица.ДокументОтгрузки,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Назначение,
		|					Таблица.Серия,
		|					Таблица.Получатель,
		|					Таблица.Склад
		|				ИЗ
		|					ДвиженияТоварыКОтгрузкеИзменение КАК Таблица)) КАК ТаблицаОстатков";
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров <> 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Обороты(
			|				,
			|				,
			|				,
			|				(ДокументОтгрузки, Номенклатура, Характеристика, Назначение, Серия, Склад) В
			|					(ВЫБРАТЬ
			|						Таблица.ДокументОтгрузки,
			|						Таблица.Номенклатура,
			|						Таблица.Характеристика,
			|						Таблица.Назначение,
			|						Таблица.Серия,
			|						Таблица.Склад
			|					ИЗ
			|						ДвиженияТоварыКОтгрузкеИзменение КАК Таблица)) КАК ТаблицаОборотов
			|		ПО ТаблицаОстатков.ДокументОтгрузки = ТаблицаОборотов.ДокументОтгрузки
			|			И ТаблицаОстатков.Номенклатура = ТаблицаОборотов.Номенклатура
			|			И ТаблицаОстатков.Характеристика = ТаблицаОборотов.Характеристика
			|			И ТаблицаОстатков.Назначение = ТаблицаОборотов.Назначение
			|			И ТаблицаОстатков.Серия = ТаблицаОборотов.Серия
			|			И ТаблицаОстатков.Склад = ТаблицаОборотов.Склад
			|ГДЕ
			|	ТаблицаОстатков.смартКОтгрузкеГарантийныеОстаток - ТаблицаОстатков.смартСобираетсяГарантийныеОстаток - ТаблицаОстатков.смартСобраноГарантийныеОстаток < ВЫБОР
			|		КОГДА ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)
			|			ТОГДА -&ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров / 100 * ТаблицаОборотов.смартКОтгрузкеГарантийныеПриход
			|		ИНАЧЕ 0
			|	КОНЕЦ";
			ПакетЗапросов.УстановитьПараметр("ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров",
				ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров);
			ПакетЗапросов.УстановитьПараметр("МерныеТипыЕдиницИзмерений",
				Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ
			|	ТаблицаОстатков.смартКОтгрузкеГарантийныеОстаток - ТаблицаОстатков.смартСобираетсяГарантийныеОстаток - ТаблицаОстатков.смартСобраноГарантийныеОстаток < 0";
			
		КонецЕсли;
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	//-- #Б1448 смарт: Шляпников 28.11.2024
	
	Если МассивКонтролей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
	ПакетЗапросов.Текст = ТекстЗапроса;
	//-- #Б1448 смарт: Шляпников 28.11.2024
	ПакетЗапросов.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	
	МассивРезультатов = ПакетЗапросов.ВыполнитьПакет();

	Итератор = -1;
	Для Каждого Результат Из МассивРезультатов Цикл

		Итератор = Итератор + 1;
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;

		ИмяКонтроля = МассивКонтролей[Итератор];

		Если ИмяКонтроля = ВРег("смартЗаявкиНаРазборкуОборудования") Тогда
			
			СообщитьОбОшибкахПроведенияПоРегиструСмартЗаявкиНаРазборкуОборудования(Объект, Отказ, Результат);
			
		//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
		ИначеЕсли ИмяКонтроля = Врег("смартОбеспечениеВременнаяТаблица1Гарантийные") Тогда

		ИначеЕсли ИмяКонтроля = Врег("смартОбеспечениеВременнаяТаблица2Гарантийные") Тогда

		ИначеЕсли ИмяКонтроля = Врег("смартОбеспечениеГарантийные") Тогда

			смарт_СообщитьОбОшибкахПроведенияПоРегистрамСвободныеОстаткиИДвижениеТоваров(Объект, Отказ, Результат);
			
		ИначеЕсли ИмяКонтроля = Врег("смартТоварыКОтгрузкеГарантийные") Тогда

			смарт_СообщитьОбОшибкахПроведенияПоРегиструТоварыКОтгрузке(Объект, Отказ, Результат);
			
		//-- #Б1448 смарт: Шляпников 28.11.2024
		Иначе

			ВызватьИсключение НСтр("ru = 'Ошибка контроля проведения'");

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ #1901 смарт: Ермаков 21.04.2024 / Создание документа Заявка на разборку оборудования
Процедура СообщитьОбОшибкахПроведенияПоРегиструСмартЗаявкиНаРазборкуОборудования(Объект, Отказ, РезультатЗапроса)
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка проведения регистра Заявки на разборку оборудования", Объект,,, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
Функция смарт_ТекстЗапросаКонтрольОбеспечения(ЕстьИзмененияСвободныеОстатки, ЕстьИзмененияГрафикОтгрузкиТоваров)

	Если ЕстьИзмененияСвободныеОстатки И ЕстьИзмененияГрафикОтгрузкиТоваров Тогда

		ТекстТаблицыТоваров =
		"ВЫБРАТЬ
		|	Т.Номенклатура               КАК Номенклатура,
		|	Т.Характеристика             КАК Характеристика,
		|	Т.Склад                      КАК Склад,
		|	ДАТАВРЕМЯ(1, 1, 1)           КАК Период
		|ПОМЕСТИТЬ ВтТоварыДляКонтроляОбеспеченияГарантийные
		|ИЗ
		|	ДвиженияСвободныеОстаткиИзменение КАК Т
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Т.Номенклатура   КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	Т.Склад          КАК Склад,
		|	Т.Период         КАК Период
		|ИЗ
		|	ДвиженияГрафикОтгрузкиТоваровИзменение КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////
		|";

	ИначеЕсли ЕстьИзмененияСвободныеОстатки Тогда

		ТекстТаблицыТоваров =
		"ВЫБРАТЬ
		|	Т.Номенклатура               КАК Номенклатура,
		|	Т.Характеристика             КАК Характеристика,
		|	Т.Склад                      КАК Склад,
		|	ДАТАВРЕМЯ(1, 1, 1)           КАК Период
		|ПОМЕСТИТЬ ВтТоварыДляКонтроляОбеспеченияГарантийные
		|ИЗ
		|	ДвиженияСвободныеОстаткиИзменение КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////
		|";

	ИначеЕсли ЕстьИзмененияГрафикОтгрузкиТоваров Тогда

		ТекстТаблицыТоваров =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Т.Номенклатура   КАК Номенклатура,
		|	Т.Характеристика КАК Характеристика,
		|	Т.Склад          КАК Склад,
		|	Т.Период         КАК Период
		|ПОМЕСТИТЬ ВтТоварыДляКонтроляОбеспеченияГарантийные
		|ИЗ
		|	ДвиженияГрафикОтгрузкиТоваровИзменение КАК Т
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Характеристика, Склад
		|;
		|
		|/////////////////////////////////////////////
		|";

	КонецЕсли;

	ТекстЗапроса = ТекстТаблицыТоваров
	+"ВЫБРАТЬ
	|	Т.Номенклатура   КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	Т.Склад          КАК Склад,
	|	Т.Период         КАК Период,
	|	МАКСИМУМ(ОстаткиИзЗаказов.ДатаДоступности) КАК Дата
	|
	|ПОМЕСТИТЬ ВтТоварыКонтроляГрафикаГарантийные
	|ИЗ
	|	ВтТоварыДляКонтроляОбеспеченияГарантийные КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ОстаткиИзЗаказов
	|			ПО Т.Номенклатура   = ОстаткиИзЗаказов.Номенклатура
	|			 И Т.Характеристика = ОстаткиИзЗаказов.Характеристика
	|			 И Т.Склад          = ОстаткиИзЗаказов.Склад
	|			 И Т.Период >= ОстаткиИзЗаказов.ДатаДоступности
	|СГРУППИРОВАТЬ ПО
	|	Т.Номенклатура, Т.Характеристика, Т.Склад,
	|	Т.Период
	|
	|ИМЕЮЩИЕ
	|	НЕ МАКСИМУМ(ОстаткиИзЗаказов.ДатаДоступности) ЕСТЬ NULL
	|;
	|
	|/////////////////////////////////////////////
	|";

	ТекстЗапроса = ТекстЗапроса
	+"ВЫБРАТЬ
	|	Набор.Номенклатура        КАК Номенклатура,
	|	Набор.Характеристика      КАК Характеристика,
	|	Набор.Склад               КАК Склад,
	|	Набор.Период              КАК Период,
	|	МАКСИМУМ(Набор.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|
	|	СУММА(Набор.смартВНаличииГарантийные)          КАК смартВНаличииГарантийные,
	|	СУММА(Набор.смартВРезервеИзЗаказовГарантийные) КАК смартВРезервеИзЗаказовГарантийные,
	|	СУММА(Набор.смартВРезервеСоСкладаГарантийные)  КАК смартВРезервеСоСкладаГарантийные,
	|	СУММА(Набор.смартВРезервеПодЗаказГарантийные)  КАК смартВРезервеПодЗаказГарантийные
	|
	|ИЗ(
	|	ВЫБРАТЬ
	|		Т.Номенклатура        КАК Номенклатура,
	|		Т.Характеристика      КАК Характеристика,
	|		Т.Склад               КАК Склад,
	|		Т.Период              КАК Период,
	|		СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|
	|		ОстаткиСклада.смартВНаличииГарантийныеОстаток            КАК смартВНаличииГарантийные,
	|		0                                        				   КАК смартВРезервеИзЗаказовГарантийные,
	|		ОстаткиСклада.смартВРезервеСоСкладаГарантийныеОстаток      КАК смартВРезервеСоСкладаГарантийные,
	|		ОстаткиСклада.смартВРезервеПодЗаказГарантийныеОстаток      КАК смартВРезервеПодЗаказГарантийные
	|	ИЗ
	|		ВтТоварыДляКонтроляОбеспеченияГарантийные КАК Т
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(,
	|				(Номенклатура, Характеристика, Склад) В(
	|					ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Т.Номенклатура        КАК Номенклатура,
	|						Т.Характеристика      КАК Характеристика,
	|						Т.Склад               КАК Склад
	|					ИЗ
	|						ВтТоварыДляКонтроляОбеспеченияГарантийные КАК Т)) КАК ОстаткиСклада
	|			ПО Т.Номенклатура   = ОстаткиСклада.Номенклатура
	|			 И Т.Характеристика = ОстаткиСклада.Характеристика
	|			 И Т.Склад          = ОстаткиСклада.Склад
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО Т.Номенклатура = СпрНоменклатура.Ссылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			Т.Номенклатура   КАК Номенклатура,
	|			Т.Характеристика КАК Характеристика,
	|			Т.Склад          КАК Склад,
	|			Т.Период         КАК Период,
	|			СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|
	|			0                                  КАК смартВНаличииГарантийные,
	|			- ОстаткиИзЗаказов.смартКоличествоГарантийные      КАК смартВРезервеИзЗаказовГарантийные,
	|			0                                  КАК смартВРезервеСоСкладаГарантийные,
	|			0                                  КАК смартВРезервеПодЗаказГарантийные
	|		ИЗ
	|			ВтТоварыКонтроляГрафикаГарантийные КАК Т
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ОстаткиИзЗаказов
	|				ПО Т.Номенклатура   = ОстаткиИзЗаказов.Номенклатура
	|				 И Т.Характеристика = ОстаткиИзЗаказов.Характеристика
	|				 И Т.Склад          = ОстаткиИзЗаказов.Склад
	|				 И Т.Дата           = ОстаткиИзЗаказов.ДатаДоступности
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|				ПО Т.Номенклатура = СпрНоменклатура.Ссылка) КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.Номенклатура, Набор.Характеристика, Набор.Склад,
	|	Набор.Период
	|
	|ИМЕЮЩИЕ
	|	 Набор.Период = ДАТАВРЕМЯ(1, 1, 1) И(
	|		СУММА(Набор.смартВНаличииГарантийные) < 0
	|		ИЛИ СУММА(Набор.смартВНаличииГарантийные) - СУММА(Набор.смартВРезервеПодЗаказГарантийные) < 0
	|		ИЛИ СУММА(Набор.смартВНаличииГарантийные) - СУММА(Набор.смартВРезервеПодЗаказГарантийные) - СУММА(Набор.смартВРезервеСоСкладаГарантийные) < 0)
	|
	|	ИЛИ СУММА(Набор.смартВНаличииГарантийные) - СУММА(Набор.смартВРезервеПодЗаказГарантийные) - СУММА(Набор.смартВРезервеСоСкладаГарантийные) - СУММА(Набор.смартВРезервеИзЗаказовГарантийные) < 0 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура, Характеристика, Склад";

	Возврат ТекстЗапроса;

КонецФункции

//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
Процедура смарт_СообщитьОбОшибкахПроведенияПоРегистрамСвободныеОстаткиИДвижениеТоваров(Объект, Отказ, РезультатЗапроса)

	ШаблонСообщенияВНаличииМеньшеНоляГарантийные = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
	|Недостаточно гарантйиного товара в наличии на складе %Склад% на %Количество% %Единица%'");

	ШаблонСообщенияВНаличииМеньшеРезерваИзЗаказовНаДатуГарантийные = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
	|Превышен доступный на %Период% гарантийный остаток товара на складе %Склад% на %Количество% %Единица%'");

	ШаблонСообщенияВНаличииМеньшеРезерваИзЗаказовГарантийные = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% 
	|Превышен доступный гарантийный остаток товара на складе %Склад% на %Количество% %Единица%'");

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если ЗначениеЗаполнено(Выборка.Период)
			И Выборка.смартВНаличииГарантийные - Выборка.смартВРезервеПодЗаказГарантийные - Выборка.смартВРезервеСоСкладаГарантийные - Выборка.смартВРезервеИзЗаказовГарантийные < 0 Тогда

			ШаблонСообщения = ШаблонСообщенияВНаличииМеньшеРезерваИзЗаказовНаДатуГарантийные;
			Количество      = - (Выборка.смартВНаличииГарантийные - Выборка.смартВРезервеПодЗаказГарантийные - Выборка.смартВРезервеСоСкладаГарантийные - Выборка.смартВРезервеИзЗаказовГарантийные);

		ИначеЕсли Выборка.смартВНаличииГарантийные < 0 Тогда

			ШаблонСообщения = ШаблонСообщенияВНаличииМеньшеНоляГарантийные;
			Количество      = - Выборка.смартВНаличииГарантийные;

		ИначеЕсли Выборка.смартВНаличииГарантийные - Выборка.смартВРезервеПодЗаказГарантийные - Выборка.смартВРезервеСоСкладаГарантийные - Выборка.смартВРезервеИзЗаказовГарантийные < 0 Тогда

			ШаблонСообщения = ШаблонСообщенияВНаличииМеньшеРезерваИзЗаказовГарантийные;
			Количество      = - (Выборка.смартВНаличииГарантийные - Выборка.смартВРезервеПодЗаказГарантийные - Выборка.смартВРезервеСоСкладаГарантийные - Выборка.смартВРезервеИзЗаказовГарантийные);
			
		Иначе

			ВызватьИсключение НСтр("ru='Неизвестная ошибка контроля обеспечения.'");

		КонецЕсли;

		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристика%",
		НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(Количество));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%",      Строка(Выборка.Склад));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Единица%",    Строка(Выборка.ЕдиницаИзмерения));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Период%",     Строка(Формат(Выборка.Период, "ДЛФ=D")));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект, ,, Отказ);

	КонецЦикла;

КонецПроцедуры

//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
Процедура смарт_СообщитьОбОшибкахПроведенияПоРегиструТоварыКОтгрузке(Объект, Отказ, РезультатЗапроса)

	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Объект, "Статус")
		И Объект.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору Тогда 
		ШаблонСообщения = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% %Назначение%
		|Планируется к отгрузке со склада %Склад% больше, чем указано в распоряжении на отгрузку, на %Количество% %Единица%'");
	Иначе
		ШаблонСообщения = НСтр("ru = 'Номенклатура %НоменклатураХарактеристика% %Назначение%
		|Отгружено со склада %Склад% больше, чем указано в распоряжении на отгрузку, на %Количество% %Единица%'");
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%НоменклатураХарактеристика%",
		НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика,,Выборка.Серия));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(-Выборка.КоличествоГарантийные));
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%",      Строка(Выборка.Склад));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Единица%",    Строка(Выборка.ЕдиницаИзмерения));
		Назначение = ?(ЗначениеЗаполнено(Выборка.Назначение), "(" + Строка(Выборка.Назначение) + ")", "");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Назначение%", Назначение);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект, ,, Отказ);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
